# Pandas II dalis

In [123]:
import numpy as np
import pandas as pd

### Trūkstami duomenys

Susikursime pavyzdį:

In [124]:
df = pd.DataFrame(np.random.rand(5,6), 
                  ['a', 'b', 'c', 'd', 'e'], 
                  ['U', 'V', 'W', 'X', 'Y', 'Z'])

In [125]:
df

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
b  0.954683  0.570112  0.267251  0.113468  0.705813  0.784988
c  0.183440  0.506220  0.010524  0.545230  0.849483  0.974421
d  0.662572  0.921950  0.599473  0.094866  0.279201  0.828048
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

In [126]:
table = df[df>.15]

In [127]:
table

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
b  0.954683  0.570112  0.267251       NaN  0.705813  0.784988
c  0.183440  0.506220       NaN  0.545230  0.849483  0.974421
d  0.662572  0.921950  0.599473       NaN  0.279201  0.828048
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

pirmas metodas tvarkytis su trūkstamais duomenimis yra **.dropna()**. Jis išmeta visas eilutes, kuriose yra bent viena NaN reikšmė:

In [128]:
table.dropna()

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

jeigu norime išmesti stulpelius, turinčius bent vieną NaN, turime nurodyti ašį:

In [129]:
table.dropna(axis=1)

          U         V         Y         Z
a  0.610905  0.779957  0.885760  0.424900
b  0.954683  0.570112  0.705813  0.784988
c  0.183440  0.506220  0.849483  0.974421
d  0.662572  0.921950  0.279201  0.828048
e  0.641951  0.815278  0.818182  0.952332

Galime išmesti tik tas eilutes, ar stulpelius, kurie turi mažiau, negu (pvz) 5 **NE** NaN reikšmes:

In [130]:
table.dropna(thresh=5)

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
b  0.954683  0.570112  0.267251       NaN  0.705813  0.784988
c  0.183440  0.506220       NaN  0.545230  0.849483  0.974421
d  0.662572  0.921950  0.599473       NaN  0.279201  0.828048
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

Papildomai nurodžius ašį, tą patį galima padaryti ir su stulpeliais.

Jei norime NaN reikšmes pakeisti kažkuo kitu, naudosime **.fillna()** metodą:

In [131]:
table.fillna('bupkis')

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
b  0.954683  0.570112  0.267251    bupkis  0.705813  0.784988
c  0.183440  0.506220    bupkis   0.54523  0.849483  0.974421
d  0.662572  0.921950  0.599473    bupkis  0.279201  0.828048
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

Daugiau prasmės būtų pakeisti pvz. stulpelio vidurkiu:

In [132]:
table['W'].fillna(value=table['W'].mean())

a    0.877686
b    0.267251
c    0.610877
d    0.599473
e    0.699097
Name: W, dtype: float64

In [133]:
table.fillna(value=table.mean())

          U         V         W         X         Y         Z
a  0.610905  0.779957  0.877686  0.722668  0.885760  0.424900
b  0.954683  0.570112  0.267251  0.650282  0.705813  0.784988
c  0.183440  0.506220  0.610877  0.545230  0.849483  0.974421
d  0.662572  0.921950  0.599473  0.650282  0.279201  0.828048
e  0.641951  0.815278  0.699097  0.682948  0.818182  0.952332

### Grupavimas

Susikurkime pavyzdį:

In [134]:
duomenys = {'Šalis': ['Lietuva',
  'Lietuva',
  'Lietuva',
  'Latvija',
  'Latvija',
  'Latvija',
  'Estija',
  'Estija',
  'Estija'],
 'Miestas': ['Vilnius',
  'Kaunas',
  'Klaipėda',
  'Ryga',
  'Ventspilis',
  'Daugpilis',
  'Talinas',
  'Tartu',
  'Pernu'],
 'Gyv': [541, 287, 147, 716, 43, 105, 400, 101, 46]}

In [135]:
data = pd.DataFrame(duomenys)

In [136]:
data

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105
6   Estija     Talinas  400
7   Estija       Tartu  101
8   Estija       Pernu   46

panaudokime **.groupby()** metodą, viduje nurodydami stulpelį, pagal kurį grupuosime.

In [137]:
data.groupby('Šalis')

gavome groupby objektą, kuris turi savo metodus. Tam kad galėtumėm jais naudotis, priskirkime objektą kintamąjam:

In [138]:
baltic = data.groupby('Šalis')

In [139]:
baltic

**.mean()** skaičiuos mums vidurkį:

In [140]:
baltic.mean()

                Gyv
Šalis
Estija   182.333333
Latvija  288.000000
Lietuva  325.000000

**.sum()** sumuos:

In [141]:
baltic.sum()

         Gyv
Šalis
Estija   547
Latvija  864
Lietuva  975

iš groupby objekto galime trukti reikšmes tokiu būdu:

**.count()** suskaičiuos kiek yra įrašų grupės stulpeliuose:

In [142]:
baltic.count()

         Miestas  Gyv
Šalis
Estija         3    3
Latvija        3    3
Lietuva        3    3

*atkreipkite dėmesį, kad jeigu metodas negali atlikti veiksmo su stulpelio įrašais, rezultate to stulpelio ir nerodo. šiuo atveju galime suskaičiuoti string įrašus, todėl stulpelis 'Miestas' įtrauktas į rezultatą*

**.max()** duos eilutę su maksimaliu, **.min()** su minimaliu rezultatais:

In [143]:
baltic.max()

            Miestas  Gyv
Šalis
Estija        Tartu  400
Latvija  Ventspilis  716
Lietuva     Vilnius  541

In [144]:
baltic.min()

           Miestas  Gyv
Šalis
Estija       Pernu   46
Latvija  Daugpilis   43
Lietuva     Kaunas  147

šiuo atveju matome, kad miestų stulpelį išrūšiavo pagal abėcelę, o skaičius, kaip ir tikėjomės. Max ir min nėra labai praktiški su *string* tipo reikšmėmis.

iš **groupby** objektų galime traukti reikšmes:

In [145]:
baltic.sum().loc['Lietuva']

Gyv    975
Name: Lietuva, dtype: int64

**.describe()** metodas duoda pagrindinę informaciją apie lentelės duomenis:

In [146]:
baltic.describe()

          Gyv
        count        mean         std    min    25%    50%    75%    max
Šalis
Estija    3.0  182.333333  190.500219   46.0   73.5  101.0  250.5  400.0
Latvija   3.0  288.000000  371.952954   43.0   74.0  105.0  410.5  716.0
Lietuva   3.0  325.000000  199.729818  147.0  217.0  287.0  414.0  541.0

galime sukeisti stulpelius su eilutėmis su **.transpose()**:

In [147]:
baltic.describe().transpose()

Šalis          Estija     Latvija     Lietuva
Gyv count    3.000000    3.000000    3.000000
    mean   182.333333  288.000000  325.000000
    std    190.500219  371.952954  199.729818
    min     46.000000   43.000000  147.000000
    25%     73.500000   74.000000  217.000000
    50%    101.000000  105.000000  287.000000
    75%    250.500000  410.500000  414.000000
    max    400.000000  716.000000  541.000000

jeigu domina vieno kurio nors stulpelio statistika, galime ją ištraukti taip:

In [148]:
baltic.describe().transpose()['Estija']

Gyv  count      3.000000
     mean     182.333333
     std      190.500219
     min       46.000000
     25%       73.500000
     50%      101.000000
     75%      250.500000
     max      400.000000
Name: Estija, dtype: float64

### DF Jungimas

susikurkime pavyzdžius:

In [149]:
data_main = data[0:6]

In [150]:
data_main

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105

In [151]:
data_bottom = data[6:]

In [152]:
data_bottom

    Šalis  Miestas  Gyv
6  Estija  Talinas  400
7  Estija    Tartu  101
8  Estija    Pernu   46

norėdami sujungti data_main su data_bottom naudosime **.concat()** metodą, viduje įrašydami lentelių, kurias jungsime sąrašą:

In [153]:
pd.concat([data_main, data_bottom])

     Šalis     Miestas  Gyv
0  Lietuva     Vilnius  541
1  Lietuva      Kaunas  287
2  Lietuva    Klaipėda  147
3  Latvija        Ryga  716
4  Latvija  Ventspilis   43
5  Latvija   Daugpilis  105
6   Estija     Talinas  400
7   Estija       Tartu  101
8   Estija       Pernu   46

galime prijungti lentelę iš dešinės:

In [154]:
pd.concat([data_main, data_bottom], axis=1)

     Šalis     Miestas    Gyv   Šalis  Miestas    Gyv
0  Lietuva     Vilnius  541.0     NaN      NaN    NaN
1  Lietuva      Kaunas  287.0     NaN      NaN    NaN
2  Lietuva    Klaipėda  147.0     NaN      NaN    NaN
3  Latvija        Ryga  716.0     NaN      NaN    NaN
4  Latvija  Ventspilis   43.0     NaN      NaN    NaN
5  Latvija   Daugpilis  105.0     NaN      NaN    NaN
6      NaN         NaN    NaN  Estija  Talinas  400.0
7      NaN         NaN    NaN  Estija    Tartu  101.0
8      NaN         NaN    NaN  Estija    Pernu   46.0

matome, kad pandas ieškojo antroje lentelėje sutampančių indeksų, ir neradus atliko jungimą užpildant tuščias vietas NaN. Todėl jungiant, reikia įsitikinti, kad jungimui tinka abi pusės. Pertvarkykime data_right indeksą:

In [155]:
data_right = data_bottom.reset_index()

In [156]:
data_right.drop(columns='index', inplace=True)

In [157]:
data_right

    Šalis  Miestas  Gyv
0  Estija  Talinas  400
1  Estija    Tartu  101
2  Estija    Pernu   46

In [158]:
pd.concat([data_main, data_right], axis=1)

     Šalis     Miestas  Gyv   Šalis  Miestas    Gyv
0  Lietuva     Vilnius  541  Estija  Talinas  400.0
1  Lietuva      Kaunas  287  Estija    Tartu  101.0
2  Lietuva    Klaipėda  147  Estija    Pernu   46.0
3  Latvija        Ryga  716     NaN      NaN    NaN
4  Latvija  Ventspilis   43     NaN      NaN    NaN
5  Latvija   Daugpilis  105     NaN      NaN    NaN

dabar pandas surado sutampančius indeksus, tačiau visvien turime NaN reikšmes, kadangi lentelėje trūksta duomenų. Pridėkime papildomų eilučių:

In [159]:
lenkija = {'Šalis': ['Lenkija', 'Lenkija', 'Lenkija'], 
           'Miestas':['Varšuva', 'Vroclavas', 'Gdanskas'], 
          'Gyv': [1688, 638, 461]}
pl = pd.DataFrame(lenkija)
data_right1 = pd.concat([data_right, pl])

In [160]:
data_right = data_right1.reset_index().drop(columns='index')

In [161]:
data_right

     Šalis    Miestas   Gyv
0   Estija    Talinas   400
1   Estija      Tartu   101
2   Estija      Pernu    46
3  Lenkija    Varšuva  1688
4  Lenkija  Vroclavas   638
5  Lenkija   Gdanskas   461

Pabandykime sujungti data_main su data_right :)

In [162]:
pd.concat([data_main, data_right], 1)

     Šalis     Miestas  Gyv    Šalis    Miestas   Gyv
0  Lietuva     Vilnius  541   Estija    Talinas   400
1  Lietuva      Kaunas  287   Estija      Tartu   101
2  Lietuva    Klaipėda  147   Estija      Pernu    46
3  Latvija        Ryga  716  Lenkija    Varšuva  1688
4  Latvija  Ventspilis   43  Lenkija  Vroclavas   638
5  Latvija   Daugpilis  105  Lenkija   Gdanskas   461

**.merge()**

Jeigu *data_main* ir *data_right* turėtų po vieną sutampantį stulpelį, pvz.:

In [167]:
key = 'A B C D E F'.split()
data_main['key'] = key
data_right['key'] = key

/home/robotautas/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [165]:
data_main

     Šalis     Miestas  Gyv key
0  Lietuva     Vilnius  541   A
1  Lietuva      Kaunas  287   B
2  Lietuva    Klaipėda  147   C
3  Latvija        Ryga  716   D
4  Latvija  Ventspilis   43   E
5  Latvija   Daugpilis  105   F

In [166]:
data_right

     Šalis    Miestas   Gyv key
0   Estija    Talinas   400   A
1   Estija      Tartu   101   B
2   Estija      Pernu    46   C
3  Lenkija    Varšuva  1688   D
4  Lenkija  Vroclavas   638   E
5  Lenkija   Gdanskas   461   F

galima jas sulieti to bendro stulpelio pagrindu:

In [168]:
pd.merge(data_main, data_right, key=key)

TypeError: merge() got an unexpected keyword argument 'key'